parameter = 0

# Ορισμός

"""
Functions (= Συνάρτηση) στην Python είναι μια συλλογή από εντολές που εκτελούνται όταν την καλούμε.
Μπορούμε να κάνουμε δικά μας functions ή να χρησιμοποιήσουμε από τις προεγκατεστημένες μέσα στην Python
"""

# Βασικές Προεγκατεστημένες συναρτήσεις

"""
H Python έχει αρκετές προεγκατεστημένες functions που μπορούμε να χρησιμοποιήσουμε. 
Μερικές βασικές από αυτές είναι οι εξής: 
"""

print(parameter)  # Εκτυπώνει την τιμή μιας παραμέτρου (π.χ. μεταβλητή) στην οθόνη
input(parameter)  # Επιτρέπει στον χρήστη να εισάγει τιμή σε μια παράμετρο (π.χ. μεταβλητή)
len(parameter)  # Επιστρέφει το μήκος της τιμής μιας παραμέτρου (π.χ. μεταβλητής)
range(parameter)  # Επιστρέφει μια σειρά από αριθμούς από το 0 μέχρι την τιμή της παραμέτρου (π.χ. μεταβλητής)
int(parameter)  # Μετατρέπει την τιμή μιας παραμέτρου (π.χ. μεταβλητής) σε ακέραιο αριθμό

# Παράδειγμα

a = input("Δώσε αριθμό: ")
a = int(a)  # Μετατρέπει την τιμή της μεταβλητής a σε ακέραιο αριθμό
print(a)  # Εκτυπώνει την τιμή της μεταβλητής a

# Δημιουργία και κλήση συνάρτησης

# Σύνταξη

"""
def <όνομα συνάρτησης>():
    <εντολές>

<όνομα συνάρτησης>()  # Κλήση συνάρτησης
"""


# Παράδειγμα

def my_function():  # Δημιουργία συνάρτησης
    print("Hello World!")  # Εντολές στη συνάρτηση


my_function()  # Κλήση συνάρτησης

# Παράμετροι

# Ορισμός

"""
Οι παράμετροι είναι προσωρινές μεταβλητές που χρησιμοποιούνται μόνο μέσα στην συνάρτηση.
Μπορούμε να ορίσουμε πολλές παραμέτρους χωρίζοντάς τες με κόμμα.
"""

# Σύνταξη

"""
def <όνομα συνάρτησης>(<παράμετρος 1>, <παράμετρος 2>, ...):
    <εντολές>

<όνομα συνάρτησης>(<τιμή παραμέτρου 1>, <τιμή παραμέτρου 2>, ...)  # Κλήση συνάρτησης
"""


# Παράδειγμα

def my_function(name):  # Δημιουργία συνάρτησης με παράμετρο
    print("Hello " + name)  # Εντολές στη συνάρτηση


my_function("John")  # Κλήση συνάρτησης με παράμετρο

# Global και Local μεταβλητές

# Global

"""
Οι global μεταβλητές είναι μεταβλητές που δημιουργούνται εκτός της συνάρτησης.
Μπορούν να χρησιμοποιηθούν μέσα και έξω από την συνάρτηση.
"""

# Local

"""
Οι local μεταβλητές είναι μεταβλητές που δημιουργούνται μέσα στην συνάρτηση.
Μπορούν να χρησιμοποιηθούν μόνο μέσα στην συνάρτηση.
"""

# Παράδειγμα

x = "awesome"  # Global μεταβλητή


def my_function(var):
    print(var)  # Local μεταβλητή


# Μετατροπή Local μεταβλητής σε Global

# Σύνταξη

"""
global <όνομα μεταβλητής>
"""


# Παράδειγμα

def my_function():
    global x
    x = "fantastic"


my_function()
