#While

#Ορισμός

'''
Το while είναι ένα εργαλείο με το οποίο μπορείς να επαναλάβεις ένα κομμάτι κώδικα για όσο μια προϋπόθεση ισχύει.
'''

#Σύνταξη

'''
while <προϋπόθεση>:
	<αποτέλεσμα>
'''

#Παράδηγμα

example = 0

while example <= 10:
	example += 1
	print(example)

#Ιδιότιτες while

#1) break

#Ορισμός

'''
Με το break μπορείς να σταματήσεις την while ή την for από το να συνεχίζουν τα ελένχουν το εάν οι επόμενες προϋποθέσεις ισχύουν.
'''

#Παράδηγμα

example = 0
boolian = False

while example < 10:
	if boolian == True:
		break
	example += 1
	print(example)
	boolian = True

#Εδώ θα τυποθεί μόνο το '1' γιατί θέτουμε το boolian = True και το while σταματάει από το break που ενεργοποιήτε μόνο αν το boolian = True'

#2) while True:

#Σύνταξη

'''
while True:
	<αποτέλεσμα>
'''

#Ορισμός

'''
Με το "while True:" μπορούμε να κάνουμε τον κώδικα μέσα στο while να επαναλαμβάνετε για πάντα
'''

#Παράδηγμα

example = 0

while True:
	example += 1
	print(example)

#Σε αυτό το κομμάτι του κώδικα θα


#===============================================================
#***************************************************************
#%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
	
#For

#Σύνταξη

'''
for <στοιχείο> in <ακολουθεία>:
  <αποτέλεσμα>
'''

#Ορισμό
'''
Το for είναι ένα ακόμα εργαλείο, αρκετά παρόμοιο με το while, στο οποίο δείουμε μία ακολουθεία (range, tuple, κτλ.) και αυτό για κάθε ένα στοιχείο το οποίο βρίσκεται σε αυτήν τρέχει μία συγκεκριμένη εντολή.
'''

#Παράδειγμα
my_list = [1,2,3,5,7,9]

for number in my_list:
  print(number)

#================================================================
#****************************************************************
#%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%


#input
#Σύνταξη

'''
input("κείμενο")
'''

#Ορισμός

'''
Με το input μπορεί και ο χρήστης να εισάγει δεδομένα και έτσι να κάνουμε το πρόγραμμά μας πιο διαδραστικό κάνοντας ερωτήσεις (π.χ. Quiz κτλ.) και όχι μόνο (π.χ. εισαγωγή user name κτλ.)
'''

#Παράδηγμα

name = input("Ποιο είναι το όνομά σου; ")
print(name)