# Libraries

'''
Libraries (ή modules) είναι "πακέτα" που δημιουργήθηκαν απο άλλους προγραμματιστές
που δημιουργήσαν κομμάτια κώδικα για να μπορούμε εμείς να ενσωματόσουμε στον κώδικά μας με ευκολία.
Ουσιαστηκά εισάγουν functions που μας προσφέρουν μεγαλύτερη λειτουργικότητα.
Ένα παράδηγμα είναι η βιβλιοθήκη "datetime" που μας επιτρέπει να πάρουμε την ημέρα και την ώρα.
'''

# Εισαγωγή βιβλιοθήκης

# Σύνταξη

'''
import <όνομα βιβλιοθήκης>
'''

# Παράδηγμα

import datetime

# Εισαγωγή ενός πακέτου από μια βιβλιοθήκη

'''
Κάποιες φορές μπορεί να θέλουμε να εισάγουμε μόνο μια συνάρτηση από μια βιβλιοθήκη.
'''

# Σύνταξη

'''
from <όνομα βιβλιοθήκης> import <όνομα πακέτου>
'''

# Παράδηγμα

from datetime import date

# as

'''
Μπορεί να θέλουμε να μετεονομάσουμε την συνάρτηση από ένα πακέτο μιας βιβλιοθήκης
'''

# Σύνταξη 

'''
from <όνομα βιβλιοθήκης> import <όνομα πακέτου> as <νέο όνομα>
'''

# Παράδηγμα

from matplotlib import pyplot as plt

# Χρήσιμες βιβλιοθήκες

'''
Εδώ είναι μια λίστα με μερικές βιβλιοθήκες
που μπορούν να είναι χρήσιμες για τα project σου

- datetime -> επιτρέπει την λήψη της ώρας και την ημερομινίας
- random -> επιτρέπει την λήψη τυχαίων αριθμών κα
- os -> επιτρέπει τον έλεγχο του λειτουργικού συστήματος

'''