#Ορισμός

'''
Tuples (= Πλειάδες) είναι μία συλλογή δεδομένων όπου οι τιμές τους δεν μπορούν να αλλάξουν σε αντίθεση με τις λίστες.
'''

#Σύνταξη

'''
<όνομα πλειάδας> = (<1η τιμή, <2η τιμή>, <...>, <Ν τιμή>)
'''

'''
Προσοχή! Το κόμμα ανάμεσα τα στοιχεία είναι πάντα απαραίτητο.
Παράδειγμα:
tuple = (1, )
'''

#Ομοιότητες με τις λίστες
'''
-Είναι συλλογές δεδομένων.
-Υπάρχει σειρά στα αποθηκευμένα δεδομένα.
-Έχουν την ίδια αρίθμηση.
'''

#Διαφορές από τις λίστς

'''
-Τα δεδομένα μέσα σε ένα tuple δεν μπορούν να αλλάξουν.
-Ορίζονται (τα tuples) μέσα σε παρενθέσεις.
-Είναι απαρέτητα (στα tuples) τα κόμματα ανάμεσα στα δεδομένα.
'''

#Παράδειγμα

tuple = (1, 3, 5, 7)
print(tuple[0:2])

#For element

#Ορισμός

'''
To for element χρησιμοποιείται για να εκτελούμε μία συνάρτηση 
όσες φορές όσα είναι και τα στοιχεία μέσα σε ένα τύπο δεδομένων (π.χ. tuples, lists,...).
'''

#Σύνταξη

'''
for <όνομα στοιχείου> in <όνομα τύπου δεδομένων>:
'''

#Παράδειγμα
list = [0,2,4,6,8,10,12,14]
for number in list:
    print(number)

#If element

#Ορισμός

'''
To if element χρησιμοποιείτε για να εκτελούμε μία συνάρτηση 
εάν μέσα σε έναν τύπο δεδομένων (π.χ. tuples, lists,...) υπάρχει το στοιχείο το οποίο έχουμε ορίσει.
'''

#Σύνταξη

'''
if <όνομα στοιχείου> in <όνομα τύπου δεδομένων>:
'''

#Παράδειγμα

tuple = (1,3,5,7,9,11,13,15)
if 13 in tuple:
    print("There is a 13.")